lucckb/isixrtos/libusb/include/usb/drivers/controllers/stm32/usb_otg_regs.h
#ifndef _USB_OTG_REGS_H
#define _USB_OTG_REGS_H 1

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined STM32F10X_CL

  #define _USB_OTG_BASE_ADDR  0x50000000

  /* Core supports 4 device endpoints and 8 host channels. */
  #define EP_MAX_COUNT     4
  #define CHNNL_MAX_COUNT  8

  #define CONST_EP_MAX_COUNT     EP_MAX_COUNT
  #define CONST_CHNNL_MAX_COUNT  CHNNL_MAX_COUNT

  #define FIFO_DWORDS_SIZE  320

  #define OTG_FS_REGS_USED  1
  #define OTG_HS_REGS_USED  0

#elif defined STM32F2XX || defined STM32F4XX

  #define USB_OTG_FS_BASE_ADDR  0x50000000
  #define USB_OTG_HS_BASE_ADDR  0x40040000

  /* FS core supports 4 device endpoints and 8 host channels. */
  #define FS_EP_MAX_COUNT     4
  #define FS_CHNNL_MAX_COUNT  8

  /* HS core supports 6 device endpoints and 12 host channels. */
  #define HS_EP_MAX_COUNT     6
  #define HS_CHNNL_MAX_COUNT  12

  #if HS_EP_MAX_COUNT > FS_EP_MAX_COUNT
    #define CONST_EP_MAX_COUNT  HS_EP_MAX_COUNT
  #else
    #define CONST_EP_MAX_COUNT  FS_EP_MAX_COUNT
  #endif

  #if HS_CHNNL_MAX_COUNT > FS_CHNNL_MAX_COUNT
    #define CONST_CHNNL_MAX_COUNT  HS_CHNNL_MAX_COUNT
  #else
    #define CONST_CHNNL_MAX_COUNT  FS_CHNNL_MAX_COUNT
  #endif

  #define FIFO_DWORDS_SIZE  1024

  extern uint32_t _USB_OTG_BASE_ADDR;
  extern unsigned EP_MAX_COUNT;
  extern unsigned CHNNL_MAX_COUNT;

  #define USE_OTG_FS_REGS()                   \
    _USB_OTG_BASE_ADDR = USB_OTG_FS_BASE_ADDR, \
    EP_MAX_COUNT      = FS_EP_MAX_COUNT,      \
    CHNNL_MAX_COUNT   = FS_CHNNL_MAX_COUNT

  #define USE_OTG_HS_REGS()                   \
    _USB_OTG_BASE_ADDR = USB_OTG_HS_BASE_ADDR, \
    EP_MAX_COUNT      = HS_EP_MAX_COUNT,      \
    CHNNL_MAX_COUNT   = HS_CHNNL_MAX_COUNT

  #define OTG_FS_REGS_USED (_USB_OTG_BASE_ADDR == USB_OTG_FS_BASE_ADDR)
  #define OTG_HS_REGS_USED (_USB_OTG_BASE_ADDR == USB_OTG_HS_BASE_ADDR)

#endif

#if defined STM32F10X_CL || defined STM32F2XX || defined STM32F4XX

#define USB_MAX_HOST_PACKET_COUNT  1023

#define USB_OTG_CORE_GLOBAL_REG_OFFSET   0x0000
#define USB_OTG_HOST_GLOBAL_REG_OFFSET   0x0400
#define USB_OTG_HOST_CHANNEL_REG_OFFSET  0x0500
#define USB_OTG_DEV_GLOBAL_REG_OFFSET    0x0800
#define USB_OTG_DEV_IN_EP_REG_OFFSET     0x0900
#define USB_OTG_DEV_OUT_EP_REG_OFFSET    0x0B00
#define USB_OTG_PCGCCTL_OFFSET           0x0E00
#define USB_OTG_DATA_FIFO_OFFSET         0x1000
#define USB_OTG_DATA_FIFO_SIZE           0x1000

/*********************************************************************
* The USB_OTG_GREGS structure defines the relative field offsets for
* the core global control and status registers.
*********************************************************************/
typedef struct {
  volatile uint32_t GOTGCTL;       /* 000 control and status */
  volatile uint32_t GOTGINT;       /* 004 interrupt */
  volatile uint32_t GAHBCFG;       /* 008 AHB configuration */
  volatile uint32_t GUSBCFG;       /* 00C USB configuration */
  volatile uint32_t GRSTCTL;       /* 010 reset */
  volatile uint32_t GINTSTS;       /* 014 core interrupt */
  volatile uint32_t GINTMSK;       /* 018 interrupt mask */
  volatile uint32_t GRXSTSR;       /* 01C receive status debug read */
  volatile uint32_t GRXSTSP;       /* 020 receive status pop */
  volatile uint32_t GRXFSIZ;       /* 024 receive FIFO size */
  volatile uint32_t HNPTXFSIZ;     /* 028 host non-periodic transmit FIFO size */
  volatile uint32_t HNPTXSTS;      /* 02C host non-periodic transmit FIFO status */
  volatile uint32_t GI2CCTL;       /* 030 I2C access */
  volatile uint32_t reserved34;    /* 034 reserved */
  volatile uint32_t GCCFG;         /* 038 general core configuration */
  volatile uint32_t CID;           /* 03C core ID */
  volatile uint32_t reserved4[48]; /* 040 reserved */
  volatile uint32_t HPTXFSIZ;      /* 100 host periodic transmit FIFO size */
  volatile uint32_t DIEPTXFx[11];  /* 104 IN EP transmit FIFO size */
} USB_OTG_GREGS;

/* 028 device endpoint 0 transmit FIFO size */
#define DIEPTXF0  HNPTXFSIZ

#define P_USB_OTG_GREGS \
  ((USB_OTG_GREGS *)(_USB_OTG_BASE_ADDR + USB_OTG_CORE_GLOBAL_REG_OFFSET))

typedef union { /* offset 0x0008 */
  uint32_t d32;
  struct {
    uint32_t gintmsk      :  1; /* gint - do not change */
    uint32_t hbstlen      :  4;
    uint32_t dmaen        :  1;
    uint32_t reserved6    :  1;
    uint32_t txfelvl      :  1;
    uint32_t ptxfelvl     :  1;
    uint32_t reserved9_31 : 23;
  } b;
} USB_OTG_GAHBCFG_TypeDef;

typedef union { /* offset 0x000C */
  uint32_t d32;
  struct {
    uint32_t tocal         :  3;
    uint32_t phyif         :  1; /* undocumented in RM0008 and RM0033 */
    uint32_t ulpisel       :  1; /* undocumented in RM0008 and RM0033 */
    uint32_t fsintf        :  1; /* undocumented in RM0008 and RM0033 */
    uint32_t physel        :  1; /* undocumented in RM0008 and RM0033 */
    uint32_t ddrsel        :  1; /* undocumented in RM0008 and RM0033 */
    uint32_t srpcap        :  1;
    uint32_t hnpcap        :  1;
    uint32_t trdt          :  4; /* badly documented in RM0008 and RM0033 */
    uint32_t nptxfrwnden   :  1; /* undocumented in RM0008 and RM0033 */
    uint32_t phylpcs       :  1;
    uint32_t otgutmifssel  :  1; /* undocumented in RM0008 and RM0033 */
    uint32_t ulpifsls      :  1;
    uint32_t ulpiar        :  1;
    uint32_t ulpicsm       :  1;
    uint32_t ulpievbusd    :  1;
    uint32_t ulpievbusi    :  1;
    uint32_t tsdps         :  1;
    uint32_t pcci          :  1;
    uint32_t ptci          :  1;
    uint32_t ulpiipd       :  1;
    uint32_t reserved26_28 :  3;
    uint32_t fhmod         :  1;
    uint32_t fdmod         :  1;
    uint32_t ctxpkt        :  1;
  } b;
} USB_OTG_GUSBCFG_TypeDef;

typedef union { /* offset 0x0010 */
  uint32_t d32;
  struct {
    uint32_t csrst         :  1;
    uint32_t hsrst         :  1;
    uint32_t fcrst         :  1;
    uint32_t reserved3     :  1;
    uint32_t rxfflsh       :  1;
    uint32_t txfflsh       :  1;
    uint32_t txfnum        :  5;
    uint32_t reserved11_29 : 19;
    uint32_t dmareq        :  1;
    uint32_t ahbidl        :  1;
  } b;
} USB_OTG_GRSTCTL_TypeDef;

typedef union { /* offset 0x0014 */
  uint32_t d32;
  struct {
    uint32_t cmod          :  1;
    uint32_t mmis          :  1;
    uint32_t otgint        :  1;
    uint32_t sof           :  1;
    uint32_t rxflvl        :  1;
    uint32_t nptxfe        :  1;
    uint32_t ginakeff      :  1;
    uint32_t gonakeff      :  1; /* boutnakeff - do not change */
    uint32_t reserved8_9   :  2;
    uint32_t esusp         :  1;
    uint32_t usbsusp       :  1;
    uint32_t usbrst        :  1;
    uint32_t enumdne       :  1;
    uint32_t isoodrp       :  1;
    uint32_t eopf          :  1;
    uint32_t reserved16_17 :  2;
    uint32_t iepint        :  1;
    uint32_t oepint        :  1;
    uint32_t iisoixfr      :  1;
    uint32_t iisooxfr      :  1; /* ipxfr_incompisoout - do not change */
    uint32_t datafsusp     :  1;
    uint32_t reserved23    :  1;
    uint32_t hprtint       :  1;
    uint32_t hcint         :  1;
    uint32_t ptxfe         :  1;
    uint32_t reserved27    :  1;
    uint32_t cidschg       :  1;
    uint32_t discint       :  1;
    uint32_t srqint        :  1;
    uint32_t wkuint        :  1;
  } b;
} USB_OTG_GINTSTS_TypeDef;

typedef union { /* offset 0x0018 */
  uint32_t d32;
  struct {
    uint32_t reserved0   :  1;
    uint32_t mmism       :  1;
    uint32_t otgm        :  1; /* otgint - do not change */
    uint32_t sofm        :  1;
    uint32_t rxflvlm     :  1;
    uint32_t nptxfem     :  1;
    uint32_t ginakeffm   :  1;
    uint32_t gonakeffm   :  1;
    uint32_t reserved8_9 :  2;
    uint32_t esuspm      :  1;
    uint32_t usbsuspm    :  1;
    uint32_t usbrstm     :  1; /* usbrst - do not change */
    uint32_t enumdnem    :  1;
    uint32_t isoodrpm    :  1;
    uint32_t eopfm       :  1;
    uint32_t reserved16  :  1;
    uint32_t epmism      :  1;
    uint32_t iepim       :  1; /* iepint - do not change */
    uint32_t oepim       :  1; /* oepint - do not change */
    uint32_t iisoixfrm   :  1;
    uint32_t iisooxfrm   :  1; /* ipxfrm_iisooxfrm - do not change */
    uint32_t fsuspm      :  1;
    uint32_t reserved23  :  1;
    uint32_t hprtim      :  1; /* prtim - do not change */
    uint32_t hcim        :  1;
    uint32_t ptxfem      :  1;
    uint32_t reserved27  :  1;
    uint32_t cidschgm    :  1;
    uint32_t discim      :  1; /* discint - do not change */
    uint32_t srqim       :  1;
    uint32_t wkuim       :  1; /* wuim - do not change */
  } b;
} USB_OTG_GINTMSK_TypeDef;

typedef union { /* offset 0x0020 */
  uint32_t d32;
  struct {
    uint32_t ch_ep_num     :  4;
    uint32_t bcnt          : 11;
    uint32_t dpid          :  2;
    uint32_t pktsts        :  4;
    uint32_t frmnum        :  4;
    uint32_t reserved25_31 :  7;
  } b;
} USB_OTG_GRXSTS_TypeDef;

#define GRXSTS_DPID_DATA0  0
#define GRXSTS_DPID_DATA2  1
#define GRXSTS_DPID_DATA1  2
#define GRXSTS_DPID_MDATA  3

#define GRXSTS_PKTSTS_IN_RECEIVED        2
#define GRXSTS_PKTSTS_IN_COMPLETED       3
#define GRXSTS_PKTSTS_DATA_TOGGLE_ERROR  5
#define GRXSTS_PKTSTS_CHANNEL_HALTED     7

#define GRXSTS_PKTSTS_GLOBAL_OUT_NAK   1
#define GRXSTS_PKTSTS_OUT_RECEIVED     2
#define GRXSTS_PKTSTS_OUT_COMPLETED    3
#define GRXSTS_PKTSTS_SETUP_COMPLETED  4
#define GRXSTS_PKTSTS_SETUP_RECEIVED   6

typedef union { /* offset 0x002C */
  uint32_t d32;
  struct {
    uint32_t nptxfsav           : 16;
    uint32_t nptxqsav           :  8; /* nptqxsav - do not change */
    uint32_t nptxqtop_terminate :  1;
    uint32_t nptxqtop_timer     :  2;
    uint32_t nptxqtop_chnum     :  4;
    uint32_t reserved31         :  1;
  } b;
} USB_OTG_HNPTXSTS_TypeDef;

/* DIEPTXF0 offset 0x0028
   DIEPTXFx offset 0x0104 + 4 * (fifo_num - 1) */
typedef union {
  uint32_t d32;
  struct {
    uint32_t startaddr : 16;
    uint32_t depth     : 16;
  } b;
} USB_OTG_FIFOSIZE_TypeDef;

typedef union { /* offset 0x0030h */
  uint32_t d32;
  struct {
    uint32_t rwdata     :  8;
    uint32_t regaddr    :  8;
    uint32_t addr       :  7;
    uint32_t i2cen      :  1;
    uint32_t ack        :  1;
    uint32_t reserved25 :  1;
    uint32_t i2cdevaddr :  2; /* i2cdevadr - do not change */
    uint32_t i2cdatse0  :  1;
    uint32_t reserved29 :  1;
    uint32_t rw         :  1;
    uint32_t bsyndne    :  1;
  } b;
} USB_OTG_GI2CCTL_TypeDef;

typedef union { /* offset 0x0038h */
  uint32_t d32;
  struct {
    uint32_t reserved0_15  : 16;
    uint32_t pwrdwn        :  1;
    uint32_t i2cpaden      :  1;
    uint32_t vbusasen      :  1;
    uint32_t vbusbsen      :  1;
    uint32_t sofouten      :  1;
    uint32_t novbussens    :  1;
    uint32_t reserved22_31 : 10;
  } b;
} USB_OTG_GCCFG_TypeDef;

/*********************************************************************
* The USB_OTG_HOST structure defines the relative field offsets for
* the host-mode control and status global registers.
* These registers are visible only in the host mode and must not be
* accessed in the device mode, as the results are unknown.
*********************************************************************/
typedef struct {
  volatile uint32_t HCFG;          /* 400 configuration */
  volatile uint32_t HFIR;          /* 404 frame interval */
  volatile uint32_t HFNUM;         /* 408 frame number / frame time remaining */
  volatile uint32_t reserved0C;    /* 40C reserved */
  volatile uint32_t HPTXSTS;       /* 410 periodic transmit FIFO status */
  volatile uint32_t HAINT;         /* 414 all channels interrupt */
  volatile uint32_t HAINTMSK;      /* 418 all channels interrupt mask */
  volatile uint32_t reserved1C[9]; /* 41C reserved */
  volatile uint32_t HPRT;          /* 440 port control and status */
} USB_OTG_HREGS;

#define P_USB_OTG_HREGS \
  ((USB_OTG_HREGS *)(_USB_OTG_BASE_ADDR + USB_OTG_HOST_GLOBAL_REG_OFFSET))

typedef union { /* offset 0x0400 */
  uint32_t d32;
  struct {
    uint32_t fslspcs      :  2; /* the same coding as usb_speed_t */
    uint32_t fslss        :  1;
    uint32_t reserved3_31 : 29;
  } b;
} USB_OTG_HCFG_TypeDef;

