lucckb/isixrtos/libusb/include/usb/drivers/controllers/stm32/usb_otg_regs.h
/*
#define HCFG_FSLSPCS_30_60_MHZ  0
#define HCFG_FSLSPCS_48_MHZ     1
#define HCFG_FSLSPCS_6_MHZ      2
*/

typedef union { /* offset 0x0404 */
  uint32_t d32;
  struct {
    uint32_t frivl         : 16;
    uint32_t reserved16_31 : 16;
  } b;
} USB_OTG_HFIR_TypeDef;

typedef union { /* offset 0x0408 */
  uint32_t d32;
  struct {
    uint32_t frnum : 16;
    uint32_t ftrem : 16;
  } b;
} USB_OTG_HFNUM_TypeDef;

typedef union { /* offset 0x0410 */
  uint32_t d32;
  struct {
    uint32_t ptxfsav           : 16;
    uint32_t ptxqsav           :  8;
    uint32_t ptxqtop_terminate :  1;
    uint32_t ptxqtop_type      :  2;
    uint32_t ptxqtop_chnum     :  4;
    uint32_t ptxqtop_odd       :  1;
  } b;
} USB_OTG_HPTXSTS_TypeDef;

typedef union { /* offset 0x0414 */
  uint32_t d32;
  struct {
    uint32_t haint         : 16;
    uint32_t reserved16_31 : 16;
  } b;
} USB_OTG_HAINT_TypeDef;

typedef union { /* offset 0x0418 */
  uint32_t d32;
  struct {
    uint32_t haintm        : 16;
    uint32_t reserved16_31 : 16;
  } b;
} USB_OTG_HAINTMSK_TypeDef;

typedef union { /* offset 0x0440 */
  uint32_t d32;
  struct {
    uint32_t pcsts         :  1;
    uint32_t pcdet         :  1;
    uint32_t pena          :  1;
    uint32_t penchng       :  1;
    uint32_t poca          :  1;
    uint32_t pocchng       :  1;
    uint32_t pres          :  1;
    uint32_t psusp         :  1;
    uint32_t prst          :  1;
    uint32_t reserved9     :  1;
    uint32_t plsts         :  2;
    uint32_t ppwr          :  1;
    uint32_t ptctl         :  4;
    uint32_t pspd          :  2; /* the same coding as usb_speed_t */
    uint32_t reserved19_31 : 13;
  } b;
} USB_OTG_HPRT_TypeDef;

/*********************************************************************
* The USB_OTG_HC_REGS structure defines the relative field offsets for
* the host-mode channel control and status global registers.
* These registers are visible only in the host mode and must not be
* accessed in the device mode, as the results are unknown.
*********************************************************************/
typedef struct {
  volatile uint32_t HCCHARx;    /* 500 + 20 * ch_num, channel characteristics */
  volatile uint32_t HCSPLTx;    /* 504 + 20 * ch_num, channel split control */
  volatile uint32_t HCINTx;     /* 508 + 20 * ch_num, channel interrupt */
  volatile uint32_t HCINTMSKx;  /* 50C + 20 * ch_num, channel interrupt mask */
  volatile uint32_t HCTSIZx;    /* 510 + 20 * ch_num, transfer size */
  volatile uint32_t HCDMAx;     /* 514 + 20 * ch_num, channel DMA address */
  volatile uint32_t reserved18; /* 518 + 20 * ch_num, reserved */
  volatile uint32_t reserved1C; /* 51C + 20 * ch_num, reserved */
} USB_OTG_HCHNNLS;

#define P_USB_OTG_HCHNNLS \
  ((USB_OTG_HCHNNLS *)(_USB_OTG_BASE_ADDR + USB_OTG_HOST_CHANNEL_REG_OFFSET))

typedef union { /* offset 0x0500 + 0x0020 * ch_num */
  uint32_t d32;
  struct {
    uint32_t mpsiz      : 11;
    uint32_t epnum      :  4;
    uint32_t epdir      :  1;
    uint32_t reserved16 :  1;
    uint32_t lsdev      :  1;
    uint32_t eptyp      :  2;
    uint32_t mcnt       :  2; /* mc - do not change */
    uint32_t dad        :  7;
    uint32_t oddfrm     :  1;
    uint32_t chdis      :  1;
    uint32_t chena      :  1;
  } b;
} USB_OTG_HCCHARx_TypeDef;

typedef union { /* offset 0x0508 + 0x0020 * ch_num */
  uint32_t d32;
  struct {
    uint32_t xfrc          :  1;
    uint32_t chh           :  1;
    uint32_t ahberr        :  1;
    uint32_t stall         :  1;
    uint32_t nak           :  1;
    uint32_t ack           :  1;
    uint32_t nyet          :  1;
    uint32_t txerr         :  1;
    uint32_t bberr         :  1;
    uint32_t frmor         :  1;
    uint32_t dterr         :  1;
    uint32_t reserved11_31 : 21;
  } b;
} USB_OTG_HCINTx_TypeDef;

typedef union { /* offset 0x050C + 0x0020 * ch_num */
  uint32_t d32;
  struct {
    uint32_t xfrcm         :  1;
    uint32_t chhm          :  1;
    uint32_t ahberrm       :  1; /* ahberr - do not change */
    uint32_t stallm        :  1;
    uint32_t nakm          :  1;
    uint32_t ackm          :  1;
    uint32_t nyetm         :  1; /* nyet - do not change */
    uint32_t txerrm        :  1;
    uint32_t bberrm        :  1;
    uint32_t frmorm        :  1;
    uint32_t dterrm        :  1;
    uint32_t reserved11_31 : 21;
  } b;
} USB_OTG_HCINTMSKx_TypeDef;

typedef union { /* offset 0x0510 + 0x0020 * ch_num */
  uint32_t d32;
  struct {
    uint32_t xfrsiz      : 19;
    uint32_t pktcnt      : 10;
    uint32_t pid         :  2;
    uint32_t rerserved31 :  1;
  } b;
} USB_OTG_HCTSIZx_TypeDef;

#define HCTSIZ_PKTCNT_MAX  1023
#define HCTSIZ_DPID_DATA0  0
#define HCTSIZ_DPID_DATA2  1
#define HCTSIZ_DPID_DATA1  2
#define HCTSIZ_DPID_MDATA  3
#define HCTSIZ_DPID_SETUP  3

/*********************************************************************
* The USB_OTG_DEV structure defines the relative field offsets for the
* device mode control and status registers.
* These registers are visible only in the device mode and must not be
* accessed in the host mode, as the results are unknown.
*********************************************************************/
typedef struct {
  volatile uint32_t DCFG;         /* 800 configuration */
  volatile uint32_t DCTL;         /* 804 control */
  volatile uint32_t DSTS;         /* 808 status */
  volatile uint32_t reserved0C;   /* 80C reserved */
  volatile uint32_t DIEPMSK;      /* 810 IN endpoint interrupt mask */
  volatile uint32_t DOEPMSK;      /* 814 OUT endpoint interrupt mask */
  volatile uint32_t DAINT;        /* 818 all endpoints interrupt */
  volatile uint32_t DAINTMSK;     /* 81C all endpoints interrupt mask */
  volatile uint32_t reserved20;   /* 820 reserved */
  volatile uint32_t reserved24;   /* 824 reserved */
  volatile uint32_t DVBUSDIS;     /* 828 VBUS discharge time */
  volatile uint32_t DVBUSPULSE;   /* 82C VBUS pulsing time */
  volatile uint32_t DTHRCTL;      /* 830 threshold control */
  volatile uint32_t DIEPEMPMSK;   /* 834 IN endpoint FIFO empty interrupt mask */
  volatile uint32_t DEACHINT;     /* 838 each endpoint interrupt */
  volatile uint32_t DEACHINTMSK;  /* 83C each endpoint interrupt mask */
  volatile uint32_t DIEPEACHMSK1; /* 840 each endpoint 1 interrupt */
} USB_OTG_DREGS;

#define P_USB_OTG_DREGS \
  ((USB_OTG_DREGS *)(_USB_OTG_BASE_ADDR + USB_OTG_DEV_GLOBAL_REG_OFFSET))

