lucckb/isixrtos/libusb/include/usb/drivers/controllers/stm32/usb_otg_regs.h
typedef union { /* offset 0x0800 */
  uint32_t d32;
  struct {
    uint32_t dspd          :  2; /* the same coding as usb_speed_t */
    uint32_t nzlsohsk      :  1;
    uint32_t reserved3     :  1;
    uint32_t dad           :  7;
    uint32_t pfivl         :  2;
    uint32_t reserved13_13 : 11;
    uint32_t perschivl     :  2;
    uint32_t reserved26_31 :  6;
  } b;
} USB_OTG_DCFG_TypeDef;

typedef union { /* offset 0x0804 */
  uint32_t d32;
  struct {
    uint32_t rwusig        :  1;
    uint32_t sdis          :  1;
    uint32_t ginsts        :  1;
    uint32_t gonsts        :  1;
    uint32_t tctl          :  3;
    uint32_t sginak        :  1;
    uint32_t cginak        :  1;
    uint32_t sgonak        :  1;
    uint32_t cgonak        :  1;
    uint32_t poprgdne      :  1;
    uint32_t reserved12_31 : 20;
  } b;
} USB_OTG_DCTL_TypeDef;

typedef union { /* offset 0x0808 */
  uint32_t d32;
  struct {
    uint32_t suspsts       :  1;
    uint32_t enumspd       :  2; /* the same coding as usb_speed_t */
    uint32_t eerr          :  1;
    uint32_t reserved4_7   :  4;
    uint32_t fnsof         : 14;
    uint32_t reserved22_31 : 10;
  } b;
} USB_OTG_DSTS_TypeDef;

typedef union { /* offset 0x0810 */
  uint32_t d32;
  struct {
    uint32_t xfrcm         :  1;
    uint32_t epdm          :  1;
    uint32_t reserved2     :  1;
    uint32_t tom           :  1;
    uint32_t ittxfemsk     :  1;
    uint32_t inepnmm       :  1;
    uint32_t inepnem       :  1;
    uint32_t reserved7     :  1;
    uint32_t txfurm        :  1;
    uint32_t bim           :  1;
    uint32_t reserved10_31 : 22;
  } b;
} USB_OTG_DIEPMSK_TypeDef;

typedef union { /* offset 0x0814 */
  uint32_t d32;
  struct {
    uint32_t xfrcm         :  1;
    uint32_t epdm          :  1;
    uint32_t reserved2     :  1;
    uint32_t stupm         :  1;
    uint32_t otepdm        :  1;
    uint32_t reserved5     :  1;
    uint32_t b2bstupm      :  1; /* b2bstup -do not change */
    uint32_t reserved7     :  1;
    uint32_t opem          :  1;
    uint32_t boim          :  1;
    uint32_t reserved10_31 : 22;
  } b;
} USB_OTG_DOEPMSK_TypeDef;

typedef union { /* offset 0x0818 */
  uint32_t d32;
  struct {
    uint32_t iepint : 16;
    uint32_t oepint : 16;
  } b;
} USB_OTG_DAINT_TypeDef;

typedef union { /* offset 0x081C */
  uint32_t d32;
  struct {
    uint32_t iepm : 16;
    uint32_t oepm : 16;
  } b;
} USB_OTG_DAINTMSK_TypeDef;

/*********************************************************************
* The USB_OTG_DINEPS structure defines one set of the IN endpoint
* specific registers per implemented logical endpoint.
* These registers are visible only in the device mode and must not be
* accessed in the host mode, as the results are unknown.
*********************************************************************/
typedef struct {
  volatile uint32_t DIEPCTLx;   /* 900 + 20 * ep_num, IN EP control */
  volatile uint32_t reserved04; /* 904 + 20 * ep_num, reserved */
  volatile uint32_t DIEPINTx;   /* 908 + 20 * ep_num, IN EP interrupt */
  volatile uint32_t reserved0C; /* 90C + 20 * ep_num, reserved */
  volatile uint32_t DIEPTSIZx;  /* 910 + 20 * ep_num, IN EP FIFO size */
  volatile uint32_t DIEPDMAx;   /* 914 + 20 * ep_num, DMA address */
  volatile uint32_t DTXFSTSx;   /* 918 + 20 * ep_num, IN EP FIFO status */
  volatile uint32_t reserved1C; /* 91C + 20 * ep_num, reserved */
} USB_OTG_DINEPS;

#define P_USB_OTG_DINEPS \
  ((USB_OTG_DINEPS *)(_USB_OTG_BASE_ADDR + USB_OTG_DEV_IN_EP_REG_OFFSET))

/*********************************************************************
* The USB_OTG_DOUTEPS structure defines one set of the OUT endpoint
* specific registers per implemented logical endpoint.
* These registers are visible only in the device mode and must not be
* accessed in the host mode, as the results are unknown.
*********************************************************************/
typedef struct {
  volatile uint32_t DOEPCTLx;   /* B00 + 20 * ep_num, OUT EP control */
  volatile uint32_t reserved04; /* B04 + 20 * ep_num, reserved */
  volatile uint32_t DOEPINTx;   /* B08 + 20 * ep_num, OUT EP interrupt */
  volatile uint32_t reserved0C; /* B0C + 20 * ep_num, reserved */
  volatile uint32_t DOEPTSIZx;  /* B10 + 20 * ep_num, OUT EP FIFO size */
  volatile uint32_t DOEPDMAx;   /* B14 + 20 * ep_num, DMA address */
  volatile uint32_t reserved18; /* B18 + 20 * ep_num, reserved */
  volatile uint32_t reserved1C; /* B1C + 20 * ep_num, reserved */
} USB_OTG_DOUTEPS;

#define P_USB_OTG_DOUTEPS \
  ((USB_OTG_DOUTEPS *)(_USB_OTG_BASE_ADDR + USB_OTG_DEV_OUT_EP_REG_OFFSET))

/* DIEPCTL0 offset 0x0900
   DIEPCTLx offset 0x0900 + 0x20 * ep_num
   DOEPCTL0 offset 0x0B00
   DOEPCTLx offset 0x0B00 + 0x20 * ep_num */
typedef union {
  uint32_t d32;
  struct {
    uint32_t mpsiz          : 11;
    uint32_t reserved11_14  :  4;
    uint32_t usbaep         :  1;
    uint32_t dpid_eonum     :  1;
    uint32_t naksts         :  1;
    uint32_t eptyp          :  2;
    uint32_t snpm           :  1;
    uint32_t stall          :  1;
    uint32_t txfnum         :  4;
    uint32_t cnak           :  1;
    uint32_t snak           :  1;
    uint32_t sd0pid_sevnfrm :  1;
    uint32_t sd1pid_soddfrm :  1;
    uint32_t epdis          :  1;
    uint32_t epena          :  1;
  } b;
} USB_OTG_DEPCTLx_TypeDef;

#define MPSIZ_64  0
#define MPSIZ_32  1
#define MPSIZ_16  2
#define MPSIZ_8   3

typedef union { /* offset 0x0908 + 0x20 * ep_num */
  uint32_t d32;
  struct {
    uint32_t xfrc          :  1;
    uint32_t epdisd        :  1;
    uint32_t reserved2     :  1;
    uint32_t toc           :  1;
    uint32_t inixfe        :  1;
    uint32_t reserved5     :  1;
    uint32_t inepne        :  1;
    uint32_t txfe          :  1;
    uint32_t txfifoudrn    :  1;
    uint32_t bna           :  1;
    uint32_t reserved10    :  1;
    uint32_t pktdrpsts     :  1;
    uint32_t berr          :  1;
    uint32_t nak           :  1;
    uint32_t reserved14_31 : 18;
  } b;
} USB_OTG_DIEPINTx_TypeDef;

typedef union { /* offset 0x0B08 + 0x20 * ep_num */
  uint32_t d32;
  struct {
    uint32_t xfrc          :  1;
    uint32_t epdisd        :  1;
    uint32_t reserved2     :  1;
    uint32_t stup          :  1;
    uint32_t otepdis       :  1;
    uint32_t reserved5     :  1;
    uint32_t b2bstup       :  1;
    uint32_t reserved7_13  :  7;
    uint32_t nyet          :  1;
    uint32_t reserved15_31 : 17;
  } b;
} USB_OTG_DOEPINTx_TypeDef;

/* DIEPTSIZ0 offset 0x0910
   DOEPTSIZ0 offset 0x0B10
   DIEPTSIZx offset 0x0910 + 0x20 * ep_num
   DOEPTSIZx offset 0x0B10 + 0x20 * ep_num */
typedef union {
  uint32_t d32;
  struct {
    uint32_t xfrsiz             : 19;
    uint32_t pktcnt             : 10;
    uint32_t stupcnt_mcnt_rxpid :  2;
    uint32_t reserved31         :  1;
  } b;
} USB_OTG_DEPTSIZx_TypeDef;

typedef union { /* offset 0x0918 + 0x20 * ep_num */
  uint32_t d32;
  struct {
    uint32_t ineptfsav     : 16;
    uint32_t reserved16_31 : 16;
  } b;
} USB_OTG_DTXFSTSx_TypeDef;

/*********************************************************************
* The USB_OTG_PREGS structure defines the relative field offsets for
* the power and clock gate control registers.
*********************************************************************/
typedef struct {
  volatile uint32_t PCGCCTL; /* E00 power and clock gate control */
} USB_OTG_PREGS;

#define P_USB_OTG_PREGS \
  ((USB_OTG_PREGS *)(_USB_OTG_BASE_ADDR + USB_OTG_PCGCCTL_OFFSET))

typedef union { /* offset 0x0E00 */
  uint32_t d32;
  struct {
    uint32_t stppclk      :  1;
    uint32_t gatehclk     :  1;
    uint32_t reserved2_3  :  2;
    uint32_t physusp      :  1;
    uint32_t reserved5_31 : 27;
  } b;
} USB_OTG_PCGCCTL_TypeDef;


/*********************************************************************
* The USB_OTG_FIFO structure defines the FIFO registers.
*********************************************************************/
typedef volatile uint32_t USB_OTG_FIFO[USB_OTG_DATA_FIFO_SIZE >> 2];

#define P_USB_OTG_FIFO \
  ((USB_OTG_FIFO *)(_USB_OTG_BASE_ADDR + USB_OTG_DATA_FIFO_OFFSET))

#endif /* STM32F10X_CL || STM32F2XX || STM32F4XX */

#ifdef __cplusplus
}
#endif

#endif /* _USB_OTG_REGS_H */
